package com.nercel.Niuke;

/**
 * @author dongxin
 * @create 2019/8/12
 * <p>
 * 输入一个整数，输出该数二进制表示中1的个数。其中负数用补码表示。
 *
 * 负数在计算机中如何表示?

数以正值的补码形式存储
-3在计算机中表示如下：
3的原码： 00000000 00000000 00000000 00000011
-3的原码：10000000 00000000 00000000 00000011
反码：11111111 11111111 11111111 11111100
补码：11111111 11111111 11111111 11111101

位运算
&：按位与运算，例：3&5 0011&0101 = 0001 --> 3&5 =1
位移运算符
<<：将一个运算符对象的各二进制位全部左移若干(n)位(例:x =x<<n)
 */
public class Solution11 {

    public int NumberOf1(int n) {
        int count = 0;
        while (n != 0) {
            count++;
            n = (n - 1) & n;
        }
        return count;
    }
}
